In [ ]:
import numpy as n
import sqlalchemy as sql

%reload_ext sql

from snowflake.sqlalchemy import URL
from sqlalchemy import create_engine

connection_string = "snowflake://{user}:{snflk_pwd}@gn56074.west-europe.azure".format(user='user', snflk_pwd='snflk_pwd')

%sql use database courses;
%sql use warehouse compute_wh;
%sql use schema sch_czechita;

### Vnořený select

Vybere 1 jako subselect

In [ ]:
%%sql
SELECT vnoreny.a 
FROM (SELECT 1 AS a) AS vnoreny;

Vybere jen některé sloupce jako subselect

In [ ]:
%%sql
SELECT * 
FROM (SELECT gname, eventdate FROM teror2 WHERE country = 54) AS subselect;

Vybere unikátní dvojice skupiny a země jako subselect

In [ ]:
%%sql
SELECT vnoreny.* 
FROM (
    SELECT DISTINCT t.gname AS skupina, c.name AS zeme 
    FROM teror2 AS t 
    INNER JOIN country AS c ON t.country=c.id
) AS vnoreny;

Zobrazení všech teroristických událostí, které spáchala teroristická organizace s nejvetším počtem obětí

In [ ]:
%%sql
SELECT gname, iyear, nkill 
FROM teror
WHERE gname = (SELECT gname FROM teror ORDER BY nkill DESC LIMIT 1);

Počet mrtvých v letech 2017 a 2016 které má na svědomí Islámský Stát tak, aby ve výsledku byl název organizace a ve sloupcích počet mrtvých dle let

In [ ]:
%%sql
SELECT  t1.*, 
        t2.pocetmrtv2016 
FROM (
        SELECT gname, SUM(nkill) as pocetmrtv2017
        FROM teror
        WHERE iyear=2017 AND gname ilike '%islamic state%' 
        GROUP BY 1
        ORDER BY pocetmrtv2017 DESC
) AS t1
LEFT JOIN (
        SELECT gname, COUNT(nkill) AS pocetmrtv2016
        FROM teror
        WHERE iyear=2016
        GROUP BY 1
        ORDER BY pocetmrtv2016 DESC
) AS t2
ON t1.gname=t2.gname;

Výběr teroristických úroků v roce 2016, které má na svědomí Islámský Stát a doplnění informace max a min počtu oětí v roce 2016 ke každému útoku

In [ ]:
%%sql
SELECT  t1.eventid, t1.gname, t1.iyear, t1.nkill, t2.maxmrtvych2016, t2.minmrtvych2016
FROM teror AS t1
LEFT JOIN (
            SELECT  gname, 
                    max(nkill) AS maxmrtvych2016, 
                    min(nkill) AS minmrtvych2016
            FROM teror
            WHERE iyear=2016 AND gname ilike '%islamic state%' 
            GROUP BY 1
) AS t2
ON t1.gname=t2.gname
WHERE t1.gname ILIKE '%islamic state%' and t1.iyear=2016;

### Co je to CTE? 

- Common Table Expressions

In [ ]:
%%sql
/*
WITH prvni_nazev_poddotazu AS (
    SELECT  sloupec_x, 
            count(*) AS vse1 
    FROM tabulka1 
    GROUP BY sloupec_x
),
druhy_nazev_poddotazu AS (
    SELECT  sloupec_y, 
            count(*) AS vse2 
    FROM tabulka2 
    GROUP BY sloupec_y
)
SELECT  sloupec_x, 
        vse1 - vse2 AS rozdil
FROM prvni_nazev_poddotazu AS p
LEFT JOIN druhy_nazev_poddotazu AS d
ON p.sloupec_x = d.sloupec_y;
*/

Ukázka 1

In [ ]:
%%sql
WITH ctepoddotaz AS (
    SELECT 1 jednicka, 'milion' dvojka
)
SELECT c.jednicka, c.dvojka FROM ctepoddotaz c;

Ukázka 2

In [ ]:
%%sql
WITH terorcountry AS (
    SELECT DISTINCT t.gname skupina, c.name zeme FROM teror2 t INNER JOIN country c ON t.country=c.id
)
SELECT * FROM terorcountry;

Ukázka 3

In [ ]:
%%sql
WITH rukojmi_po_letech_fake AS (
    SELECT iyear, SUM(nhostkid) AS rukojmi_fake 
    FROM teror 
    WHERE weaptype1_txt='Fake Weapons' AND nhostkid <> -99 
    GROUP BY iyear
), 
rukojmi_po_letech_bez_fake AS (
    SELECT iyear, SUM(nhostkid) AS rukojmi_bez_fake  
    FROM teror 
    WHERE weaptype1_txt<>'Fake Weapons' and nhostkid <> -99 
    GROUP BY iyear
)
--spojení přes roky
SELECT  f.iyear, 
        f.rukojmi_fake, 
        bf.rukojmi_bez_fake
FROM rukojmi_po_letech_fake             AS f 
LEFT JOIN rukojmi_po_letech_bez_fake    AS bf
ON f.iyear=bf.iyear;

Ukázka 4

In [ ]:
%%sql
WITH cte AS (
    SELECT gname, eventdate FROM teror2 WHERE country = 54
)
SELECT * FROM cte;